name: "coco_refinedet_xception_320x320_deploy"
input: "data"
input_shape {
  dim: 1
  dim: 3
  dim: 320
  dim: 320
}
layer {
  name: "conv1"
  type: "Convolution"
  bottom: "data"
  top: "conv1"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  convolution_param {
    num_output: 32
    bias_term: false
    pad: 1
    kernel_size: 3
    stride: 2
    weight_filler {
      type: "gaussian"
      std: 0.00999999977648
    }
  }
}
layer {
  name: "conv1_bn"
  type: "BatchNorm"
  bottom: "conv1"
  top: "conv1"
}
layer {
  name: "conv1_scale"
  type: "Scale"
  bottom: "conv1"
  top: "conv1"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "conv1_relu"
  type: "ReLU"
  bottom: "conv1"
  top: "conv1"
}
layer {
  name: "conv2"
  type: "Convolution"
  bottom: "conv1"
  top: "conv2"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  convolution_param {
    num_output: 64
    bias_term: false
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "gaussian"
      std: 0.00999999977648
    }
  }
}
layer {
  name: "conv2_bn"
  type: "BatchNorm"
  bottom: "conv2"
  top: "conv2"
}
layer {
  name: "conv2_scale"
  type: "Scale"
  bottom: "conv2"
  top: "conv2"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "conv2_relu"
  type: "ReLU"
  bottom: "conv2"
  top: "conv2"
}
layer {
  name: "xception1_match_conv"
  type: "Convolution"
  bottom: "conv2"
  top: "xception1_match_conv"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  convolution_param {
    num_output: 128
    bias_term: false
    pad: 0
    kernel_size: 1
    stride: 2
    weight_filler {
      type: "gaussian"
      std: 0.00999999977648
    }
  }
}
layer {
  name: "xception1_match_conv_bn"
  type: "BatchNorm"
  bottom: "xception1_match_conv"
  top: "xception1_match_conv"
}
layer {
  name: "xception1_match_conv_scale"
  type: "Scale"
  bottom: "xception1_match_conv"
  top: "xception1_match_conv"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "xception1_conv1_1"
  type: "ConvolutionDepthwise"
  bottom: "conv2"
  top: "xception1_conv1_1"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  convolution_param {
    num_output: 64
    bias_term: false
    pad: 1
    kernel_size: 3
    group: 64
    stride: 1
    weight_filler {
      type: "gaussian"
      std: 0.00999999977648
    }
  }
}
layer {
  name: "xception1_conv1_2"
  type: "Convolution"
  bottom: "xception1_conv1_1"
  top: "xception1_conv1_2"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  convolution_param {
    num_output: 128
    bias_term: false
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "gaussian"
      std: 0.00999999977648
    }
  }
}
layer {
  name: "xception1_conv1_bn"
  type: "BatchNorm"
  bottom: "xception1_conv1_2"
  top: "xception1_conv1_2"
}
layer {
  name: "xception1_conv1_scale"
  type: "Scale"
  bottom: "xception1_conv1_2"
  top: "xception1_conv1_2"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "xception1_conv1_relu"
  type: "ReLU"
  bottom: "xception1_conv1_2"
  top: "xception1_conv1_2"
}
layer {
  name: "xception1_conv2_1"
  type: "ConvolutionDepthwise"
  bottom: "xception1_conv1_2"
  top: "xception1_conv2_1"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  convolution_param {
    num_output: 128
    bias_term: false
    pad: 1
    kernel_size: 3
    group: 128
    stride: 1
    weight_filler {
      type: "gaussian"
      std: 0.00999999977648
    }
  }
}
layer {
  name: "xception1_conv2_2"
  type: "Convolution"
  bottom: "xception1_conv2_1"
  top: "xception1_conv2_2"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  convolution_param {
    num_output: 128
    bias_term: false
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "gaussian"
      std: 0.00999999977648
    }
  }
}
layer {
  name: "xception1_conv2_bn"
  type: "BatchNorm"
  bottom: "xception1_conv2_2"
  top: "xception1_conv2_2"
}
layer {
  name: "xception1_conv2_scale"
  type: "Scale"
  bottom: "xception1_conv2_2"
  top: "xception1_conv2_2"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "xception1_pool"
  type: "Pooling"
  bottom: "xception1_conv2_2"
  top: "xception1_pool"
  pooling_param {
    pool: MAX
    kernel_size: 3
    stride: 2
    pad: 0
  }
}
layer {
  name: "xception1_elewise"
  type: "Eltwise"
  bottom: "xception1_match_conv"
  bottom: "xception1_pool"
  top: "xception1_elewise"
}
layer {
  name: "xception2_match_conv"
  type: "Convolution"
  bottom: "xception1_elewise"
  top: "xception2_match_conv"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  convolution_param {
    num_output: 256
    bias_term: false
    pad: 0
    kernel_size: 1
    stride: 2
    weight_filler {
      type: "gaussian"
      std: 0.00999999977648
    }
  }
}
layer {
  name: "xception2_match_conv_bn"
  type: "BatchNorm"
  bottom: "xception2_match_conv"
  top: "xception2_match_conv"
}
layer {
  name: "xception2_match_conv_scale"
  type: "Scale"
  bottom: "xception2_match_conv"
  top: "xception2_match_conv"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "xception2_relu"
  type: "ReLU"
  bottom: "xception1_elewise"
  top: "xception2_relu"
}
layer {
  name: "xception2_conv1_1"
  type: "ConvolutionDepthwise"
  bottom: "xception2_relu"
  top: "xception2_conv1_1"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  convolution_param {
    num_output: 128
    bias_term: false
    pad: 1
    kernel_size: 3
    group: 128
    stride: 1
    weight_filler {
      type: "gaussian"
      std: 0.00999999977648
    }
  }
}
layer {
  name: "xception2_conv1_2"
  type: "Convolution"
  bottom: "xception2_conv1_1"
  top: "xception2_conv1_2"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  convolution_param {
    num_output: 256
    bias_term: false
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "gaussian"
      std: 0.00999999977648
    }
  }
}
layer {
  name: "xception2_conv1_bn"
  type: "BatchNorm"
  bottom: "xception2_conv1_2"
  top: "xception2_conv1_2"
}
layer {
  name: "xception2_conv1_scale"
  type: "Scale"
  bottom: "xception2_conv1_2"
  top: "xception2_conv1_2"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "xception2_conv1_relu"
  type: "ReLU"
  bottom: "xception2_conv1_2"
  top: "xception2_conv1_2"
}
layer {
  name: "xception2_conv2_1"
  type: "ConvolutionDepthwise"
  bottom: "xception2_conv1_2"
  top: "xception2_conv2_1"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  convolution_param {
    num_output: 256
    bias_term: false
    pad: 1
    kernel_size: 3
    group: 256
    stride: 1
    weight_filler {
      type: "gaussian"
      std: 0.00999999977648
    }
  }
}
layer {
  name: "xception2_conv2_2"
  type: "Convolution"
  bottom: "xception2_conv2_1"
  top: "xception2_conv2_2"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  convolution_param {
    num_output: 256
    bias_term: false
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "gaussian"
      std: 0.00999999977648
    }
  }
}
layer {
  name: "xception2_conv2_bn"
  type: "BatchNorm"
  bottom: "xception2_conv2_2"
  top: "xception2_conv2_2"
}
layer {
  name: "xception2_conv2_scale"
  type: "Scale"
  bottom: "xception2_conv2_2"
  top: "xception2_conv2_2"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "xception2_pool"
  type: "Pooling"
  bottom: "xception2_conv2_2"
  top: "xception2_pool"
  pooling_param {
    pool: MAX
    kernel_size: 3
    stride: 2
    pad: 0
  }
}
layer {
  name: "xception2_elewise"
  type: "Eltwise"
  bottom: "xception2_match_conv"
  bottom: "xception2_pool"
  top: "xception2_elewise"
}
layer {
  name: "xception3_match_conv"
  type: "Convolution"
  bottom: "xception2_elewise"
  top: "xception3_match_conv"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  convolution_param {
    num_output: 728
    bias_term: false
    pad: 0
    kernel_size: 1
    stride: 2
    weight_filler {
      type: "gaussian"
      std: 0.00999999977648
    }
  }
}
layer {
  name: "xception3_match_conv_bn"
  type: "BatchNorm"
  bottom: "xception3_match_conv"
  top: "xception3_match_conv"
}
layer {
  name: "xception3_match_conv_scale"
  type: "Scale"
  bottom: "xception3_match_conv"
  top: "xception3_match_conv"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "xception3_relu"
  type: "ReLU"
  bottom: "xception2_elewise"
  top: "xception3_relu"
}
layer {
  name: "xception3_conv1_1"
  type: "ConvolutionDepthwise"
  bottom: "xception3_relu"
  top: "xception3_conv1_1"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  convolution_param {
    num_output: 256
    bias_term: false
    pad: 1
    kernel_size: 3
    group: 256
    stride: 1
    weight_filler {
      type: "gaussian"
      std: 0.00999999977648
    }
  }
}
layer {
  name: "xception3_conv1_2"
  type: "Convolution"
  bottom: "xception3_conv1_1"
  top: "xception3_conv1_2"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  convolution_param {
    num_output: 728
    bias_term: false
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "gaussian"
      std: 0.00999999977648
    }
  }
}
layer {
  name: "xception3_conv1_bn"
  type: "BatchNorm"
  bottom: "xception3_conv1_2"
  top: "xception3_conv1_2"
}
layer {
  name: "xception3_conv1_scale"
  type: "Scale"
  bottom: "xception3_conv1_2"
  top: "xception3_conv1_2"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "xception3_conv1_relu"
  type: "ReLU"
  bottom: "xception3_conv1_2"
  top: "xception3_conv1_2"
}
layer {
  name: "xception3_conv2_1"
  type: "ConvolutionDepthwise"
  bottom: "xception3_conv1_2"
  top: "xception3_conv2_1"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  convolution_param {
    num_output: 728
    bias_term: false
    pad: 1
    kernel_size: 3
    group: 728
    stride: 1
    weight_filler {
      type: "gaussian"
      std: 0.00999999977648
    }
  }
}
layer {
  name: "xception3_conv2_2"
  type: "Convolution"
  bottom: "xception3_conv2_1"
  top: "xception3_conv2_2"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  convolution_param {
    num_output: 728
    bias_term: false
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "gaussian"
      std: 0.00999999977648
    }
  }
}
layer {
  name: "xception3_conv2_bn"
  type: "BatchNorm"
  bottom: "xception3_conv2_2"
  top: "xception3_conv2_2"
}
layer {
  name: "xception3_conv2_scale"
  type: "Scale"
  bottom: "xception3_conv2_2"
  top: "xception3_conv2_2"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "xception3_pool"
  type: "Pooling"
  bottom: "xception3_conv2_2"
  top: "xception3_pool"
  pooling_param {
    pool: MAX
    kernel_size: 3
    stride: 2
    pad: 0
  }
}
layer {
  name: "xception3_elewise"
  type: "Eltwise"
  bottom: "xception3_match_conv"
  bottom: "xception3_pool"
  top: "xception3_elewise"
}
layer {
  name: "xception4_relu"
  type: "ReLU"
  bottom: "xception3_elewise"
  top: "xception4_relu"
}
layer {
  name: "xception4_conv1_1"
  type: "ConvolutionDepthwise"
  bottom: "xception4_relu"
  top: "xception4_conv1_1"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  convolution_param {
    num_output: 728
    bias_term: false
    pad: 1
    kernel_size: 3
    group: 728
    stride: 1
    weight_filler {
      type: "gaussian"
      std: 0.00999999977648
    }
  }
}
layer {
  name: "xception4_conv1_2"
  type: "Convolution"
  bottom: "xception4_conv1_1"
  top: "xception4_conv1_2"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  convolution_param {
    num_output: 728
    bias_term: false
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "gaussian"
      std: 0.00999999977648
    }
  }
}
layer {
  name: "xception4_conv1_bn"
  type: "BatchNorm"
  bottom: "xception4_conv1_2"
  top: "xception4_conv1_2"
}
layer {
  name: "xception4_conv1_scale"
  type: "Scale"
  bottom: "xception4_conv1_2"
  top: "xception4_conv1_2"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "xception4_conv1_relu"
  type: "ReLU"
  bottom: "xception4_conv1_2"
  top: "xception4_conv1_2"
}
layer {
  name: "xception4_conv2_1"
  type: "ConvolutionDepthwise"
  bottom: "xception4_conv1_2"
  top: "xception4_conv2_1"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  convolution_param {
    num_output: 728
    bias_term: false
    pad: 1
    kernel_size: 3
    group: 728
    stride: 1
    weight_filler {
      type: "gaussian"
      std: 0.00999999977648
    }
  }
}
layer {
  name: "xception4_conv2_2"
  type: "Convolution"
  bottom: "xception4_conv2_1"
  top: "xception4_conv2_2"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  convolution_param {
    num_output: 728
    bias_term: false
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "gaussian"
      std: 0.00999999977648
    }
  }
}
layer {
  name: "xception4_conv2_bn"
  type: "BatchNorm"
  bottom: "xception4_conv2_2"
  top: "xception4_conv2_2"
}
layer {
  name: "xception4_conv2_scale"
  type: "Scale"
  bottom: "xception4_conv2_2"
  top: "xception4_conv2_2"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "xception4_conv2_relu"
  type: "ReLU"
  bottom: "xception4_conv2_2"
  top: "xception4_conv2_2"
}
layer {
  name: "xception4_conv3_1"
  type: "ConvolutionDepthwise"
  bottom: "xception4_conv2_2"
  top: "xception4_conv3_1"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  convolution_param {
    num_output: 728
    bias_term: false
    pad: 1
    kernel_size: 3
    group: 728
    stride: 1
    weight_filler {
      type: "gaussian"
      std: 0.00999999977648
    }
  }
}
layer {
  name: "xception4_conv3_2"
  type: "Convolution"
  bottom: "xception4_conv3_1"
  top: "xception4_conv3_2"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  convolution_param {
    num_output: 728
    bias_term: false
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "gaussian"
      std: 0.00999999977648
    }
  }
}
layer {
  name: "xception4_conv3_bn"
  type: "BatchNorm"
  bottom: "xception4_conv3_2"
  top: "xception4_conv3_2"
}
layer {
  name: "xception4_conv3_scale"
  type: "Scale"
  bottom: "xception4_conv3_2"
  top: "xception4_conv3_2"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "xception4_elewise"
  type: "Eltwise"
  bottom: "xception3_elewise"
  bottom: "xception4_conv3_2"
  top: "xception4_elewise"
}
layer {
  name: "xception5_relu"
  type: "ReLU"
  bottom: "xception4_elewise"
  top: "xception5_relu"
}
layer {
  name: "xception5_conv1_1"
  type: "ConvolutionDepthwise"
  bottom: "xception5_relu"
  top: "xception5_conv1_1"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  convolution_param {
    num_output: 728
    bias_term: false
    pad: 1
    kernel_size: 3
    group: 728
    stride: 1
    weight_filler {
      type: "gaussian"
      std: 0.00999999977648
    }
  }
}
layer {
  name: "xception5_conv1_2"
  type: "Convolution"
  bottom: "xception5_conv1_1"
  top: "xception5_conv1_2"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  convolution_param {
    num_output: 728
    bias_term: false
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "gaussian"
      std: 0.00999999977648
    }
  }
}
layer {
  name: "xception5_conv1_bn"
  type: "BatchNorm"
  bottom: "xception5_conv1_2"
  top: "xception5_conv1_2"
}
layer {
  name: "xception5_conv1_scale"
  type: "Scale"
  bottom: "xception5_conv1_2"
  top: "xception5_conv1_2"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "xception5_conv1_relu"
  type: "ReLU"
  bottom: "xception5_conv1_2"
  top: "xception5_conv1_2"
}
layer {
  name: "xception5_conv2_1"
  type: "ConvolutionDepthwise"
  bottom: "xception5_conv1_2"
  top: "xception5_conv2_1"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  convolution_param {
    num_output: 728
    bias_term: false
    pad: 1
    kernel_size: 3
    group: 728
    stride: 1
    weight_filler {
      type: "gaussian"
      std: 0.00999999977648
    }
  }
}
layer {
  name: "xception5_conv2_2"
  type: "Convolution"
  bottom: "xception5_conv2_1"
  top: "xception5_conv2_2"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  convolution_param {
    num_output: 728
    bias_term: false
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "gaussian"
      std: 0.00999999977648
    }
  }
}
layer {
  name: "xception5_conv2_bn"
  type: "BatchNorm"
  bottom: "xception5_conv2_2"
  top: "xception5_conv2_2"
}
layer {
  name: "xception5_conv2_scale"
  type: "Scale"
  bottom: "xception5_conv2_2"
  top: "xception5_conv2_2"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "xception5_conv2_relu"
  type: "ReLU"
  bottom: "xception5_conv2_2"
  top: "xception5_conv2_2"
}
layer {
  name: "xception5_conv3_1"
  type: "ConvolutionDepthwise"
  bottom: "xception5_conv2_2"
  top: "xception5_conv3_1"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  convolution_param {
    num_output: 728
    bias_term: false
    pad: 1
    kernel_size: 3
    group: 728
    stride: 1
    weight_filler {
      type: "gaussian"
      std: 0.00999999977648
    }
  }
}
layer {
  name: "xception5_conv3_2"
  type: "Convolution"
  bottom: "xception5_conv3_1"
  top: "xception5_conv3_2"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  convolution_param {
    num_output: 728
    bias_term: false
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "gaussian"
      std: 0.00999999977648
    }
  }
}
layer {
  name: "xception5_conv3_bn"
  type: "BatchNorm"
  bottom: "xception5_conv3_2"
  top: "xception5_conv3_2"
}
layer {
  name: "xception5_conv3_scale"
  type: "Scale"
  bottom: "xception5_conv3_2"
  top: "xception5_conv3_2"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "xception5_elewise"
  type: "Eltwise"
  bottom: "xception4_elewise"
  bottom: "xception5_conv3_2"
  top: "xception5_elewise"
}
layer {
  name: "xception6_relu"
  type: "ReLU"
  bottom: "xception5_elewise"
  top: "xception6_relu"
}
layer {
  name: "xception6_conv1_1"
  type: "ConvolutionDepthwise"
  bottom: "xception6_relu"
  top: "xception6_conv1_1"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  convolution_param {
    num_output: 728
    bias_term: false
    pad: 1
    kernel_size: 3
    group: 728
    stride: 1
    weight_filler {
      type: "gaussian"
      std: 0.00999999977648
    }
  }
}
layer {
  name: "xception6_conv1_2"
  type: "Convolution"
  bottom: "xception6_conv1_1"
  top: "xception6_conv1_2"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  convolution_param {
    num_output: 728
    bias_term: false
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "gaussian"
      std: 0.00999999977648
    }
  }
}
layer {
  name: "xception6_conv1_bn"
  type: "BatchNorm"
  bottom: "xception6_conv1_2"
  top: "xception6_conv1_2"
}
layer {
  name: "xception6_conv1_scale"
  type: "Scale"
  bottom: "xception6_conv1_2"
  top: "xception6_conv1_2"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "xception6_conv1_relu"
  type: "ReLU"
  bottom: "xception6_conv1_2"
  top: "xception6_conv1_2"
}
layer {
  name: "xception6_conv2_1"
  type: "ConvolutionDepthwise"
  bottom: "xception6_conv1_2"
  top: "xception6_conv2_1"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  convolution_param {
    num_output: 728
    bias_term: false
    pad: 1
    kernel_size: 3
    group: 728
    stride: 1
    weight_filler {
      type: "gaussian"
      std: 0.00999999977648
    }
  }
}
layer {
  name: "xception6_conv2_2"
  type: "Convolution"
  bottom: "xception6_conv2_1"
  top: "xception6_conv2_2"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  convolution_param {
    num_output: 728
    bias_term: false
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "gaussian"
      std: 0.00999999977648
    }
  }
}
layer {
  name: "xception6_conv2_bn"
  type: "BatchNorm"
  bottom: "xception6_conv2_2"
  top: "xception6_conv2_2"
}
layer {
  name: "xception6_conv2_scale"
  type: "Scale"
  bottom: "xception6_conv2_2"
  top: "xception6_conv2_2"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "xception6_conv2_relu"
  type: "ReLU"
  bottom: "xception6_conv2_2"
  top: "xception6_conv2_2"
}
layer {
  name: "xception6_conv3_1"
  type: "ConvolutionDepthwise"
  bottom: "xception6_conv2_2"
  top: "xception6_conv3_1"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  convolution_param {
    num_output: 728
    bias_term: false
    pad: 1
    kernel_size: 3
    group: 728
    stride: 1
    weight_filler {
      type: "gaussian"
      std: 0.00999999977648
    }
  }
}
layer {
  name: "xception6_conv3_2"
  type: "Convolution"
  bottom: "xception6_conv3_1"
  top: "xception6_conv3_2"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  convolution_param {
    num_output: 728
    bias_term: false
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "gaussian"
      std: 0.00999999977648
    }
  }
}
layer {
  name: "xception6_conv3_bn"
  type: "BatchNorm"
  bottom: "xception6_conv3_2"
  top: "xception6_conv3_2"
}
layer {
  name: "xception6_conv3_scale"
  type: "Scale"
  bottom: "xception6_conv3_2"
  top: "xception6_conv3_2"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "xception6_elewise"
  type: "Eltwise"
  bottom: "xception5_elewise"
  bottom: "xception6_conv3_2"
  top: "xception6_elewise"
}
layer {
  name: "xception7_relu"
  type: "ReLU"
  bottom: "xception6_elewise"
  top: "xception7_relu"
}
layer {
  name: "xception7_conv1_1"
  type: "ConvolutionDepthwise"
  bottom: "xception7_relu"
  top: "xception7_conv1_1"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  convolution_param {
    num_output: 728
    bias_term: false
    pad: 1
    kernel_size: 3
    group: 728
    stride: 1
    weight_filler {
      type: "gaussian"
      std: 0.00999999977648
    }
  }
}
layer {
  name: "xception7_conv1_2"
  type: "Convolution"
  bottom: "xception7_conv1_1"
  top: "xception7_conv1_2"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  convolution_param {
    num_output: 728
    bias_term: false
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "gaussian"
      std: 0.00999999977648
    }
  }
}
layer {
  name: "xception7_conv1_bn"
  type: "BatchNorm"
  bottom: "xception7_conv1_2"
  top: "xception7_conv1_2"
}
layer {
  name: "xception7_conv1_scale"
  type: "Scale"
  bottom: "xception7_conv1_2"
  top: "xception7_conv1_2"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "xception7_conv1_relu"
  type: "ReLU"
  bottom: "xception7_conv1_2"
  top: "xception7_conv1_2"
}
layer {
  name: "xception7_conv2_1"
  type: "ConvolutionDepthwise"
  bottom: "xception7_conv1_2"
  top: "xception7_conv2_1"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  convolution_param {
    num_output: 728
    bias_term: false
    pad: 1
    kernel_size: 3
    group: 728
    stride: 1
    weight_filler {
      type: "gaussian"
      std: 0.00999999977648
    }
  }
}
layer {
  name: "xception7_conv2_2"
  type: "Convolution"
  bottom: "xception7_conv2_1"
  top: "xception7_conv2_2"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  convolution_param {
    num_output: 728
    bias_term: false
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "gaussian"
      std: 0.00999999977648
    }
  }
}
layer {
  name: "xception7_conv2_bn"
  type: "BatchNorm"
  bottom: "xception7_conv2_2"
  top: "xception7_conv2_2"
}
layer {
  name: "xception7_conv2_scale"
  type: "Scale"
  bottom: "xception7_conv2_2"
  top: "xception7_conv2_2"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "xception7_conv2_relu"
  type: "ReLU"
  bottom: "xception7_conv2_2"
  top: "xception7_conv2_2"
}
layer {
  name: "xception7_conv3_1"
  type: "ConvolutionDepthwise"
  bottom: "xception7_conv2_2"
  top: "xception7_conv3_1"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  convolution_param {
    num_output: 728
    bias_term: false
    pad: 1
    kernel_size: 3
    group: 728
    stride: 1
    weight_filler {
      type: "gaussian"
      std: 0.00999999977648
    }
  }
}
layer {
  name: "xception7_conv3_2"
  type: "Convolution"
  bottom: "xception7_conv3_1"
  top: "xception7_conv3_2"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  convolution_param {
    num_output: 728
    bias_term: false
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "gaussian"
      std: 0.00999999977648
    }
  }
}
layer {
  name: "xception7_conv3_bn"
  type: "BatchNorm"
  bottom: "xception7_conv3_2"
  top: "xception7_conv3_2"
}
layer {
  name: "xception7_conv3_scale"
  type: "Scale"
  bottom: "xception7_conv3_2"
  top: "xception7_conv3_2"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "xception7_elewise"
  type: "Eltwise"
  bottom: "xception6_elewise"
  bottom: "xception7_conv3_2"
  top: "xception7_elewise"
}
layer {
  name: "xception8_relu"
  type: "ReLU"
  bottom: "xception7_elewise"
  top: "xception8_relu"
}
layer {
  name: "xception8_conv1_1"
  type: "ConvolutionDepthwise"
  bottom: "xception8_relu"
  top: "xception8_conv1_1"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  convolution_param {
    num_output: 728
    bias_term: false
    pad: 1
    kernel_size: 3
    group: 728
    stride: 1
    weight_filler {
      type: "gaussian"
      std: 0.00999999977648
    }
  }
}
layer {
  name: "xception8_conv1_2"
  type: "Convolution"
  bottom: "xception8_conv1_1"
  top: "xception8_conv1_2"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  convolution_param {
    num_output: 728
    bias_term: false
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "gaussian"
      std: 0.00999999977648
    }
  }
}
layer {
  name: "xception8_conv1_bn"
  type: "BatchNorm"
  bottom: "xception8_conv1_2"
  top: "xception8_conv1_2"
}
layer {
  name: "xception8_conv1_scale"
  type: "Scale"
  bottom: "xception8_conv1_2"
  top: "xception8_conv1_2"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "xception8_conv1_relu"
  type: "ReLU"
  bottom: "xception8_conv1_2"
  top: "xception8_conv1_2"
}
layer {
  name: "xception8_conv2_1"
  type: "ConvolutionDepthwise"
  bottom: "xception8_conv1_2"
  top: "xception8_conv2_1"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  convolution_param {
    num_output: 728
    bias_term: false
    pad: 1
    kernel_size: 3
    group: 728
    stride: 1
    weight_filler {
      type: "gaussian"
      std: 0.00999999977648
    }
  }
}
layer {
  name: "xception8_conv2_2"
  type: "Convolution"
  bottom: "xception8_conv2_1"
  top: "xception8_conv2_2"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  convolution_param {
    num_output: 728
    bias_term: false
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "gaussian"
      std: 0.00999999977648
    }
  }
}
layer {
  name: "xception8_conv2_bn"
  type: "BatchNorm"
  bottom: "xception8_conv2_2"
  top: "xception8_conv2_2"
}
layer {
  name: "xception8_conv2_scale"
  type: "Scale"
  bottom: "xception8_conv2_2"
  top: "xception8_conv2_2"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "xception8_conv2_relu"
  type: "ReLU"
  bottom: "xception8_conv2_2"
  top: "xception8_conv2_2"
}
layer {
  name: "xception8_conv3_1"
  type: "ConvolutionDepthwise"
  bottom: "xception8_conv2_2"
  top: "xception8_conv3_1"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  convolution_param {
    num_output: 728
    bias_term: false
    pad: 1
    kernel_size: 3
    group: 728
    stride: 1
    weight_filler {
      type: "gaussian"
      std: 0.00999999977648
    }
  }
}
layer {
  name: "xception8_conv3_2"
  type: "Convolution"
  bottom: "xception8_conv3_1"
  top: "xception8_conv3_2"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  convolution_param {
    num_output: 728
    bias_term: false
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "gaussian"
      std: 0.00999999977648
    }
  }
}
layer {
  name: "xception8_conv3_bn"
  type: "BatchNorm"
  bottom: "xception8_conv3_2"
  top: "xception8_conv3_2"
}
layer {
  name: "xception8_conv3_scale"
  type: "Scale"
  bottom: "xception8_conv3_2"
  top: "xception8_conv3_2"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "xception8_elewise"
  type: "Eltwise"
  bottom: "xception7_elewise"
  bottom: "xception8_conv3_2"
  top: "xception8_elewise"
}
layer {
  name: "xception9_relu"
  type: "ReLU"
  bottom: "xception8_elewise"
  top: "xception9_relu"
}
layer {
  name: "xception9_conv1_1"
  type: "ConvolutionDepthwise"
  bottom: "xception9_relu"
  top: "xception9_conv1_1"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  convolution_param {
    num_output: 728
    bias_term: false
    pad: 1
    kernel_size: 3
    group: 728
    stride: 1
    weight_filler {
      type: "gaussian"
      std: 0.00999999977648
    }
  }
}
layer {
  name: "xception9_conv1_2"
  type: "Convolution"
  bottom: "xception9_conv1_1"
  top: "xception9_conv1_2"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  convolution_param {
    num_output: 728
    bias_term: false
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "gaussian"
      std: 0.00999999977648
    }
  }
}
layer {
  name: "xception9_conv1_bn"
  type: "BatchNorm"
  bottom: "xception9_conv1_2"
  top: "xception9_conv1_2"
}
layer {
  name: "xception9_conv1_scale"
  type: "Scale"
  bottom: "xception9_conv1_2"
  top: "xception9_conv1_2"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "xception9_conv1_relu"
  type: "ReLU"
  bottom: "xception9_conv1_2"
  top: "xception9_conv1_2"
}
layer {
  name: "xception9_conv2_1"
  type: "ConvolutionDepthwise"
  bottom: "xception9_conv1_2"
  top: "xception9_conv2_1"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  convolution_param {
    num_output: 728
    bias_term: false
    pad: 1
    kernel_size: 3
    group: 728
    stride: 1
    weight_filler {
      type: "gaussian"
      std: 0.00999999977648
    }
  }
}
layer {
  name: "xception9_conv2_2"
  type: "Convolution"
  bottom: "xception9_conv2_1"
  top: "xception9_conv2_2"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  convolution_param {
    num_output: 728
    bias_term: false
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "gaussian"
      std: 0.00999999977648
    }
  }
}
layer {
  name: "xception9_conv2_bn"
  type: "BatchNorm"
  bottom: "xception9_conv2_2"
  top: "xception9_conv2_2"
}
layer {
  name: "xception9_conv2_scale"
  type: "Scale"
  bottom: "xception9_conv2_2"
  top: "xception9_conv2_2"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "xception9_conv2_relu"
  type: "ReLU"
  bottom: "xception9_conv2_2"
  top: "xception9_conv2_2"
}
layer {
  name: "xception9_conv3_1"
  type: "ConvolutionDepthwise"
  bottom: "xception9_conv2_2"
  top: "xception9_conv3_1"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  convolution_param {
    num_output: 728
    bias_term: false
    pad: 1
    kernel_size: 3
    group: 728
    stride: 1
    weight_filler {
      type: "gaussian"
      std: 0.00999999977648
    }
  }
}
layer {
  name: "xception9_conv3_2"
  type: "Convolution"
  bottom: "xception9_conv3_1"
  top: "xception9_conv3_2"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  convolution_param {
    num_output: 728
    bias_term: false
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "gaussian"
      std: 0.00999999977648
    }
  }
}
layer {
  name: "xception9_conv3_bn"
  type: "BatchNorm"
  bottom: "xception9_conv3_2"
  top: "xception9_conv3_2"
}
layer {
  name: "xception9_conv3_scale"
  type: "Scale"
  bottom: "xception9_conv3_2"
  top: "xception9_conv3_2"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "xception9_elewise"
  type: "Eltwise"
  bottom: "xception8_elewise"
  bottom: "xception9_conv3_2"
  top: "xception9_elewise"
}
layer {
  name: "xception10_relu"
  type: "ReLU"
  bottom: "xception9_elewise"
  top: "xception10_relu"
}
layer {
  name: "xception10_conv1_1"
  type: "ConvolutionDepthwise"
  bottom: "xception10_relu"
  top: "xception10_conv1_1"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  convolution_param {
    num_output: 728
    bias_term: false
    pad: 1
    kernel_size: 3
    group: 728
    stride: 1
    weight_filler {
      type: "gaussian"
      std: 0.00999999977648
    }
  }
}
layer {
  name: "xception10_conv1_2"
  type: "Convolution"
  bottom: "xception10_conv1_1"
  top: "xception10_conv1_2"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  convolution_param {
    num_output: 728
    bias_term: false
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "gaussian"
      std: 0.00999999977648
    }
  }
}
layer {
  name: "xception10_conv1_bn"
  type: "BatchNorm"
  bottom: "xception10_conv1_2"
  top: "xception10_conv1_2"
}
layer {
  name: "xception10_conv1_scale"
  type: "Scale"
  bottom: "xception10_conv1_2"
  top: "xception10_conv1_2"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "xception10_conv1_relu"
  type: "ReLU"
  bottom: "xception10_conv1_2"
  top: "xception10_conv1_2"
}
layer {
  name: "xception10_conv2_1"
  type: "ConvolutionDepthwise"
  bottom: "xception10_conv1_2"
  top: "xception10_conv2_1"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  convolution_param {
    num_output: 728
    bias_term: false
    pad: 1
    kernel_size: 3
    group: 728
    stride: 1
    weight_filler {
      type: "gaussian"
      std: 0.00999999977648
    }
  }
}
layer {
  name: "xception10_conv2_2"
  type: "Convolution"
  bottom: "xception10_conv2_1"
  top: "xception10_conv2_2"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  convolution_param {
    num_output: 728
    bias_term: false
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "gaussian"
      std: 0.00999999977648
    }
  }
}
layer {
  name: "xception10_conv2_bn"
  type: "BatchNorm"
  bottom: "xception10_conv2_2"
  top: "xception10_conv2_2"
}
layer {
  name: "xception10_conv2_scale"
  type: "Scale"
  bottom: "xception10_conv2_2"
  top: "xception10_conv2_2"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "xception10_conv2_relu"
  type: "ReLU"
  bottom: "xception10_conv2_2"
  top: "xception10_conv2_2"
}
layer {
  name: "xception10_conv3_1"
  type: "ConvolutionDepthwise"
  bottom: "xception10_conv2_2"
  top: "xception10_conv3_1"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  convolution_param {
    num_output: 728
    bias_term: false
    pad: 1
    kernel_size: 3
    group: 728
    stride: 1
    weight_filler {
      type: "gaussian"
      std: 0.00999999977648
    }
  }
}
layer {
  name: "xception10_conv3_2"
  type: "Convolution"
  bottom: "xception10_conv3_1"
  top: "xception10_conv3_2"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  convolution_param {
    num_output: 728
    bias_term: false
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "gaussian"
      std: 0.00999999977648
    }
  }
}
layer {
  name: "xception10_conv3_bn"
  type: "BatchNorm"
  bottom: "xception10_conv3_2"
  top: "xception10_conv3_2"
}
layer {
  name: "xception10_conv3_scale"
  type: "Scale"
  bottom: "xception10_conv3_2"
  top: "xception10_conv3_2"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "xception10_elewise"
  type: "Eltwise"
  bottom: "xception9_elewise"
  bottom: "xception10_conv3_2"
  top: "xception10_elewise"
}
layer {
  name: "xception11_relu"
  type: "ReLU"
  bottom: "xception10_elewise"
  top: "xception11_relu"
}
layer {
  name: "xception11_conv1_1"
  type: "ConvolutionDepthwise"
  bottom: "xception11_relu"
  top: "xception11_conv1_1"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  convolution_param {
    num_output: 728
    bias_term: false
    pad: 1
    kernel_size: 3
    group: 728
    stride: 1
    weight_filler {
      type: "gaussian"
      std: 0.00999999977648
    }
  }
}
layer {
  name: "xception11_conv1_2"
  type: "Convolution"
  bottom: "xception11_conv1_1"
  top: "xception11_conv1_2"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  convolution_param {
    num_output: 728
    bias_term: false
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "gaussian"
      std: 0.00999999977648
    }
  }
}
layer {
  name: "xception11_conv1_bn"
  type: "BatchNorm"
  bottom: "xception11_conv1_2"
  top: "xception11_conv1_2"
}
layer {
  name: "xception11_conv1_scale"
  type: "Scale"
  bottom: "xception11_conv1_2"
  top: "xception11_conv1_2"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "xception11_conv1_relu"
  type: "ReLU"
  bottom: "xception11_conv1_2"
  top: "xception11_conv1_2"
}
layer {
  name: "xception11_conv2_1"
  type: "ConvolutionDepthwise"
  bottom: "xception11_conv1_2"
  top: "xception11_conv2_1"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  convolution_param {
    num_output: 728
    bias_term: false
    pad: 1
    kernel_size: 3
    group: 728
    stride: 1
    weight_filler {
      type: "gaussian"
      std: 0.00999999977648
    }
  }
}
layer {
  name: "xception11_conv2_2"
  type: "Convolution"
  bottom: "xception11_conv2_1"
  top: "xception11_conv2_2"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  convolution_param {
    num_output: 728
    bias_term: false
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "gaussian"
      std: 0.00999999977648
    }
  }
}
layer {
  name: "xception11_conv2_bn"
  type: "BatchNorm"
  bottom: "xception11_conv2_2"
  top: "xception11_conv2_2"
}
layer {
  name: "xception11_conv2_scale"
  type: "Scale"
  bottom: "xception11_conv2_2"
  top: "xception11_conv2_2"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "xception11_conv2_relu"
  type: "ReLU"
  bottom: "xception11_conv2_2"
  top: "xception11_conv2_2"
}
layer {
  name: "xception11_conv3_1"
  type: "ConvolutionDepthwise"
  bottom: "xception11_conv2_2"
  top: "xception11_conv3_1"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  convolution_param {
    num_output: 728
    bias_term: false
    pad: 1
    kernel_size: 3
    group: 728
    stride: 1
    weight_filler {
      type: "gaussian"
      std: 0.00999999977648
    }
  }
}
layer {
  name: "xception11_conv3_2"
  type: "Convolution"
  bottom: "xception11_conv3_1"
  top: "xception11_conv3_2"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  convolution_param {
    num_output: 728
    bias_term: false
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "gaussian"
      std: 0.00999999977648
    }
  }
}
layer {
  name: "xception11_conv3_bn"
  type: "BatchNorm"
  bottom: "xception11_conv3_2"
  top: "xception11_conv3_2"
}
layer {
  name: "xception11_conv3_scale"
  type: "Scale"
  bottom: "xception11_conv3_2"
  top: "xception11_conv3_2"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "xception11_elewise"
  type: "Eltwise"
  bottom: "xception10_elewise"
  bottom: "xception11_conv3_2"
  top: "xception11_elewise"
}
layer {
  name: "xception12_match_conv"
  type: "Convolution"
  bottom: "xception11_elewise"
  top: "xception12_match_conv"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  convolution_param {
    num_output: 1024
    bias_term: false
    pad: 0
    kernel_size: 1
    stride: 2
    weight_filler {
      type: "gaussian"
      std: 0.00999999977648
    }
  }
}
layer {
  name: "xception12_match_conv_bn"
  type: "BatchNorm"
  bottom: "xception12_match_conv"
  top: "xception12_match_conv"
}
layer {
  name: "xception12_match_conv_scale"
  type: "Scale"
  bottom: "xception12_match_conv"
  top: "xception12_match_conv"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "xception12_relu"
  type: "ReLU"
  bottom: "xception11_elewise"
  top: "xception12_relu"
}
layer {
  name: "xception12_conv1_1"
  type: "ConvolutionDepthwise"
  bottom: "xception12_relu"
  top: "xception12_conv1_1"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  convolution_param {
    num_output: 728
    bias_term: false
    pad: 1
    kernel_size: 3
    group: 728
    stride: 1
    weight_filler {
      type: "gaussian"
      std: 0.00999999977648
    }
  }
}
layer {
  name: "xception12_conv1_2"
  type: "Convolution"
  bottom: "xception12_conv1_1"
  top: "xception12_conv1_2"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  convolution_param {
    num_output: 728
    bias_term: false
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "gaussian"
      std: 0.00999999977648
    }
  }
}
layer {
  name: "xception12_conv1_bn"
  type: "BatchNorm"
  bottom: "xception12_conv1_2"
  top: "xception12_conv1_2"
}
layer {
  name: "xception12_conv1_scale"
  type: "Scale"
  bottom: "xception12_conv1_2"
  top: "xception12_conv1_2"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "xception12_conv1_relu"
  type: "ReLU"
  bottom: "xception12_conv1_2"
  top: "xception12_conv1_2"
}
layer {
  name: "xception12_conv2_1"
  type: "ConvolutionDepthwise"
  bottom: "xception12_conv1_2"
  top: "xception12_conv2_1"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  convolution_param {
    num_output: 728
    bias_term: false
    pad: 1
    kernel_size: 3
    group: 728
    stride: 1
    weight_filler {
      type: "gaussian"
      std: 0.00999999977648
    }
  }
}
layer {
  name: "xception12_conv2_2"
  type: "Convolution"
  bottom: "xception12_conv2_1"
  top: "xception12_conv2_2"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  convolution_param {
    num_output: 1024
    bias_term: false
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "gaussian"
      std: 0.00999999977648
    }
  }
}
layer {
  name: "xception12_conv2_bn"
  type: "BatchNorm"
  bottom: "xception12_conv2_2"
  top: "xception12_conv2_2"
}
layer {
  name: "xception12_conv2_scale"
  type: "Scale"
  bottom: "xception12_conv2_2"
  top: "xception12_conv2_2"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "xception12_pool"
  type: "Pooling"
  bottom: "xception12_conv2_2"
  top: "xception12_pool"
  pooling_param {
    pool: MAX
    kernel_size: 3
    stride: 2
    pad: 0
  }
}
layer {
  name: "xception12_elewise"
  type: "Eltwise"
  bottom: "xception12_match_conv"
  bottom: "xception12_pool"
  top: "xception12_elewise"
}
layer {
  name: "conv3_1"
  type: "ConvolutionDepthwise"
  bottom: "xception12_elewise"
  top: "conv3_1"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  convolution_param {
    num_output: 1024
    bias_term: false
    pad: 1
    kernel_size: 3
    group: 1024
    stride: 1
    weight_filler {
      type: "gaussian"
      std: 0.00999999977648
    }
  }
}
layer {
  name: "conv3_2"
  type: "Convolution"
  bottom: "conv3_1"
  top: "conv3_2"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  convolution_param {
    num_output: 1536
    bias_term: false
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "gaussian"
      std: 0.00999999977648
    }
  }
}
layer {
  name: "conv3_bn"
  type: "BatchNorm"
  bottom: "conv3_2"
  top: "conv3_2"
}
layer {
  name: "conv3_scale"
  type: "Scale"
  bottom: "conv3_2"
  top: "conv3_2"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "conv3_relu"
  type: "ReLU"
  bottom: "conv3_2"
  top: "conv3_2"
}
layer {
  name: "conv4_1"
  type: "ConvolutionDepthwise"
  bottom: "conv3_2"
  top: "conv4_1"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  convolution_param {
    num_output: 1536
    bias_term: false
    pad: 1
    kernel_size: 3
    group: 1536
    stride: 1
    weight_filler {
      type: "gaussian"
      std: 0.00999999977648
    }
  }
}
layer {
  name: "conv4_2"
  type: "Convolution"
  bottom: "conv4_1"
  top: "conv4_2"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  convolution_param {
    num_output: 2048
    bias_term: false
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "gaussian"
      std: 0.00999999977648
    }
  }
}
layer {
  name: "conv4_bn"
  type: "BatchNorm"
  bottom: "conv4_2"
  top: "conv4_2"
}
layer {
  name: "conv4_scale"
  type: "Scale"
  bottom: "conv4_2"
  top: "conv4_2"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "conv4_relu"
  type: "ReLU"
  bottom: "conv4_2"
  top: "conv4_2"
}
layer {
  name: "xception13_match_conv"
  type: "Convolution"
  bottom: "conv4_2"
  top: "xception13_match_conv"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  convolution_param {
    num_output: 256
    bias_term: false
    pad: 0
    kernel_size: 1
    stride: 2
    weight_filler {
      type: "gaussian"
      std: 0.00999999977648
    }
  }
}
layer {
  name: "xception13_match_conv_bn"
  type: "BatchNorm"
  bottom: "xception13_match_conv"
  top: "xception13_match_conv"
}
layer {
  name: "xception13_match_conv_scale"
  type: "Scale"
  bottom: "xception13_match_conv"
  top: "xception13_match_conv"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "xception13_relu"
  type: "ReLU"
  bottom: "conv4_2"
  top: "xception13_relu"
}
layer {
  name: "xception13_conv1_1"
  type: "ConvolutionDepthwise"
  bottom: "xception13_relu"
  top: "xception13_conv1_1"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  convolution_param {
    num_output: 256
    bias_term: false
    pad: 1
    kernel_size: 3
    group: 256
    stride: 1
    weight_filler {
      type: "gaussian"
      std: 0.00999999977648
    }
  }
}
layer {
  name: "xception13_conv1_2"
  type: "Convolution"
  bottom: "xception13_conv1_1"
  top: "xception13_conv1_2"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  convolution_param {
    num_output: 256
    bias_term: false
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "gaussian"
      std: 0.00999999977648
    }
  }
}
layer {
  name: "xception13_conv1_2_bn"
  type: "BatchNorm"
  bottom: "xception13_conv1_2"
  top: "xception13_conv1_2"
}
layer {
  name: "xception13_conv1_2_scale"
  type: "Scale"
  bottom: "xception13_conv1_2"
  top: "xception13_conv1_2"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "xception13_conv1_2_relu"
  type: "ReLU"
  bottom: "xception13_conv1_2"
  top: "xception13_conv1_2"
}
layer {
  name: "xception13_conv2_1"
  type: "ConvolutionDepthwise"
  bottom: "xception13_conv1_2"
  top: "xception13_conv2_1"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  convolution_param {
    num_output: 256
    bias_term: false
    pad: 1
    kernel_size: 3
    group: 256
    stride: 1
    weight_filler {
      type: "gaussian"
      std: 0.00999999977648
    }
  }
}
layer {
  name: "xception13_conv2_2"
  type: "Convolution"
  bottom: "xception13_conv2_1"
  top: "xception13_conv2_2"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  convolution_param {
    num_output: 256
    bias_term: false
    pad: 0
    kernel_size: 1
    stride: 1
    weight_filler {
      type: "gaussian"
      std: 0.00999999977648
    }
  }
}
layer {
  name: "xception13_conv2_2_bn"
  type: "BatchNorm"
  bottom: "xception13_conv2_2"
  top: "xception13_conv2_2"
}
layer {
  name: "xception13_conv2_2_scale"
  type: "Scale"
  bottom: "xception13_conv2_2"
  top: "xception13_conv2_2"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "xception13_pool"
  type: "Pooling"
  bottom: "xception13_conv2_2"
  top: "xception13_pool"
  pooling_param {
    pool: MAX
    kernel_size: 3
    stride: 2
    pad: 0
  }
}
layer {
  name: "xception13_elewise"
  type: "Eltwise"
  bottom: "xception13_match_conv"
  bottom: "xception13_pool"
  top: "xception13_elewise"
}
layer {
  name: "TL6_1"
  type: "Convolution"
  bottom: "xception13_elewise"
  top: "TL6_1"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  convolution_param {
    num_output: 128
    bias_term: false
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "gaussian"
      std: 0.00999999977648
    }
  }
}
layer {
  name: "TL6_1_bn"
  type: "BatchNorm"
  bottom: "TL6_1"
  top: "TL6_1"
}
layer {
  name: "TL6_1_scale"
  type: "Scale"
  bottom: "TL6_1"
  top: "TL6_1"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "TL6_1_relu"
  type: "ReLU"
  bottom: "TL6_1"
  top: "TL6_1"
}
layer {
  name: "TL6_2"
  type: "Convolution"
  bottom: "TL6_1"
  top: "TL6_2"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  convolution_param {
    num_output: 128
    bias_term: false
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "gaussian"
      std: 0.00999999977648
    }
  }
}
layer {
  name: "TL6_2_bn"
  type: "BatchNorm"
  bottom: "TL6_2"
  top: "TL6_2"
}
layer {
  name: "TL6_2_scale"
  type: "Scale"
  bottom: "TL6_2"
  top: "TL6_2"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "TL6_2_relu"
  type: "ReLU"
  bottom: "TL6_2"
  top: "TL6_2"
}
layer {
  name: "P6"
  type: "Convolution"
  bottom: "TL6_2"
  top: "P6"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  convolution_param {
    num_output: 128
    bias_term: false
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "gaussian"
      std: 0.00999999977648
    }
  }
}
layer {
  name: "P6_bn"
  type: "BatchNorm"
  bottom: "P6"
  top: "P6"
}
layer {
  name: "P6_scale"
  type: "Scale"
  bottom: "P6"
  top: "P6"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "P6_relu"
  type: "ReLU"
  bottom: "P6"
  top: "P6"
}
layer {
  name: "TL5_1"
  type: "Convolution"
  bottom: "conv4_2"
  top: "TL5_1"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  convolution_param {
    num_output: 128
    bias_term: false
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "gaussian"
      std: 0.00999999977648
    }
  }
}
layer {
  name: "TL5_1_bn"
  type: "BatchNorm"
  bottom: "TL5_1"
  top: "TL5_1"
}
layer {
  name: "TL5_1_scale"
  type: "Scale"
  bottom: "TL5_1"
  top: "TL5_1"
  scale_param {
    bias_term: true
  }
}
layer {
  name: "TL5_1_relu"
  type: "ReLU"
  bottom: "TL5_1"
  top: "TL5_1"
}
layer {
  name: "TL5_2"
  type: "Convolution"
  bottom: "TL5_1"
  top: "TL5_2"
  param {
    lr_mult: 1.0
    decay_mult: 1.0
  }
  convolution_param {
    num_output: 128
    bias_term: false
    pad: 1
    kernel_size: 3
    stride: 1
    weight_filler {
      type: "gaussian"
